Revit 2027 API
BuiltInFailures.CurtainWallFailures.GridlinesOutOfBoundsWarn Property
 Manually placed curtain grid lines are on the wall edges or outside the wall boundaries.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId GridlinesOutOfBoundsWarn { get; }
Public Shared ReadOnly Property GridlinesOutOfBoundsWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ GridlinesOutOfBoundsWarn {
	FailureDefinitionId^ get ();
}
static member GridlinesOutOfBoundsWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace